<details ><summary>apply for monitoring 2025-03-07 07:41:10 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#monitoring has been locked by PR #32
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.grafana will be updated in-place
  ~ resource "cloudns_dns_record" "grafana" {
        id    = "564862136"
      ~ name  = "monitoring" -> (known after apply)
      ~ value = "ll45he6gkpf4r6n71u3k633nsk.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.grafana.module.grafana_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 29s [id=20531195:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.grafana.module.grafana_deployment.akash_deployment.service: Creating...
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Still creating... [40s elapsed]
module.grafana.module.grafana_deployment.akash_deployment.service: Creation complete after 47s [id=20531199:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.grafana: Modifying... [id=564862136]
cloudns_dns_record.grafana: Modifications complete after 1s [id=564862136]

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.

```
</details>

</details>